import { CharacterType } from './questions';

export type Result = {
  type: CharacterType;
  characterName : string;
  character: string;
  title: string;
  description: string[];
  storyTitle: string;
  storyText: string;
  ogTitle: string;
  ogDescription: string;
};

export const results: Record<CharacterType, Result> = {
  meursault: {
    type: 'meursault',
    characterName: '뫼르소',
    character: '『이방인』의 뫼르소',
    title: '당신은 『이방인』의 뫼르소입니다.',
    description: ['무언가가 시작되려는 순간에도,',
      ' 당신은 그 흐름을 그대로 둡니다.',
      ' 아무것도 덧붙이지 않은 채.'],
    storyTitle: '42. 안달리아의 일곱 밤',
    storyText: `밤은 유연했다.
호흡 한 번에 새벽까지 길게 다리를 뻗었고, 별이 지는 동안에도 흔들리지 않고 자리를 지켰다. 밤은 늘 느슨했고, 그러면서도 어김없이 물러날 때를 알고 있었다.

그런 밤에게 매료된 안달리아는 매일 목욕을 한 후, 달에게 간절한 기도를 올렸다. 이윽고 스산한 달빛을 타고 달의 주인이 내려왔다.

“거긴 인간이 가기엔 너무 먼 곳이야. 그래도 밤의 주인을 만나고 싶니?”
“네!"
“그렇다면, 일곱 밤 동안 푹 쉬고, 일곱 마리의 낙타와 일곱 병의 술과 물, 일곱 개의 커다란 빵을 준비하렴. 단, 빵은 반드시 하루에 하나만 먹어야 한단다. 할 수 있겠니?”
“네!"
“그럼, 오늘부터 일곱 밤이 지나면, 내가 비추는 달빛을 따라가렴.”

그렇게 일곱 날에 거쳐 안달리아는 모든 준비를 마쳤지만, 출발할 수는 없었다.
달이 사라져 어디에도 달빛이 닿지 않았던 거다. 그저 희미한 북극성 별빛만이 안달리아를 살폈다.

안달리아는 조용히 낙타를 끌어당겼다.
밤은 여전히 유연했다.`,
    ogTitle: "나는 『이방인』의 뫼르소였다",
    ogDescription: "무언가가 시작되려는 순간에도, 그 흐름을 그대로 두는 쪽이었다.",
  },

  bartleby: {
    type: 'bartleby',
    characterName: '바틀비',
    character: '허먼 멜빌의 바틀비',
    title: '당신은 허먼 멜빌의 바틀비입니다.',
    description: ['당신은 한 걸음을 내딛지 않습니다.',
         ' 그래서 모든 것이 그대로 남습니다.'],
    storyTitle: '90. 각자의 연애',
    storyText: `다코타와 존슨은 각자의 연애를 한다.

서로의 일상을 공유하고 현관문 비밀번호도 알고, 어둠 속에서 서로의 실루엣도 구분할 수 있다지만, 그들은 연인이 아니다.

둘 사이에는 적절한 침묵과 외면이 흐른다. 사랑을 말하지 않으면서도 서로에게 호감을 표할 줄 아는 영리함이 매번 애매한 관계를 유연하게 구부린다.

마주 선 평행선. 시간이 흐른다.

둘 중 누가 먼저 급해질까? 누가 먼저 흥미를 잃을까? 결국 끝을 알리는 순간이 오리라는 건 둘 모두 잘 알고 있다. 답은 확실하다. 아니, 명백한 진리다. 다만, 그것보다 먼저 일어날 수 있는 다른 일이 조금 더 두려울 뿐이다.

만약 둘의 칫솔이 한 컵에 담기는 순간이 온다면, 그건 누군가에게 비극이 된다. 이 또한 진리다. 먼저 칫솔을 들고 찾아온 이가 틀림없이 관계의 마지막 날까지 약자인 채로 남으리라.

그러니 당장 전화는 먼저 걸어도 만나자는 말은 끝끝내 삼키고 마는 두 사람.

다코타와 존슨은 오늘도 각자의 연애에만 몰입한다.`,
    ogTitle: "나는 허먼 멜빌의 바틀비였다",
    ogDescription: "한 걸음을 내딛지 않는 쪽이었다. 그래서 모든 것이 그대로 남았다.",
  },

  valjean: {
    type: 'valjean',
    characterName: '장발장',
    character: '『레 미제라블』의 장발장',
    title: '당신은 『레 미제라블』의 장발장입니다.',
    description: ['당신은 결국 나누는 쪽을 선택합니다.',
              ' 그 선택이 이후의 모든 것을 바꿉니다.'],
    storyTitle: '20. 물을 나눠줬죠',
    storyText: `기차는 지구를 벗어나고 있었다. 생존을 위해 떠나는 사람들 틈에서 얏쿰 만이 들떠 있었다.

“젠장, 지긋지긋 했던 바다도 이젠 안녕이군.”

맞은편 사내가 묻지도 않은 그의 고향과 산맥에 대한 이야길 했다. 이미 계절을 잃고 바다에 허리까지 잠긴 산맥. 영혼이 부서진 사람의 작별 대상으로 그만한 것도 없다.

“형씨는 미련이 전혀 없는 얼굴이군?”
“네, 친구를 만날 거라서요.”
“친구? 그곳에 친구가 있다고?”

얏쿰은 일부러 말을 아끼며 고개만 끄덕였다.

“가면 만날 수는 있고? 대체 무슨 죄를 지었는데?”
“…물을 나눠줬죠.”

남자가 순간 벌떡 일어섰다. 시선이 경멸로 빼곡히 차올랐다.

“정상인이 마실 물도 부족한데, 그걸 나눠줬다고? 완전히 미쳤군!”
“세상이 이 꼴이 되었다고 생명의 무게가 달라졌을까요? 전 친구가 자랑스럽네요.”

얏쿰은 고개를 돌렸다. 역시 인간은 답이 없다. 기차는 지구를 벗어나고 있었지만, 인간은 여전히 제자리걸음이었다.`,
    ogTitle: "나는 『레 미제라블』의 장발장이었다",
    ogDescription: "결국 나누는 쪽을 선택했다. 그 선택이 이후의 모든 것을 바꿨다.",
  },

  donquixote: {
    type: 'donquixote',
    characterName: '돈키호테',
    character: '『돈키호테』의 돈키호테',
    title: '당신은 『돈키호테』의 돈키호테입니다.',
    description: ['당신은 사라진 것을 위해서도',
                ' 끝까지 그 자리를 지키는 사람입니다.'],
    storyTitle: '7. 이정표',
    storyText: `도심을 지나 산길로 접어드는 좁은 샛길에는 이정표가 있다. 발이 묶인 채 평생을 살았지만, 그에겐 자긍심이 있었다.

“내가 있어야 사람들이 마을로 찾아가지.”

날개 접고 쉬어가는 새들에게 이정표는 늘 당당히 말하곤 했다. 위로 곧게 뻗은 단단한 자세로 얼마나 오랫동안 자리를 지켰던가? 점점 녹이 쓸며 피부가 벗겨져 해가 내리쬘 때마다 화끈거렸다.

그때마다 이정표는 사람들이 찾아와 색을 덧칠해주는 상상을 했다. 얼굴빛이 환하게 바뀌면, 마치 새로 만들어진 것처럼 다시 굳게 자리를 지키리라. 그렇지만, 사람들은 소식이 없었다. 시커먼 차 안에 숨은 채 지나치기 바빴다.

그러니 예정된 비극이었다. 짐을 잔뜩 실은 트럭이 이정표의 안면을 박아버렸다. 자긍심이었던 화살표가 힘없이 구겨졌다. 그래도 사람들은 찾아오지 않았다. 이제 이정표는 남은 평생 고개를 숙인 채 살아야 했다.

새들은 차마 말할 수 없었다. 이미 오래 전에 그 작은 마을은 사라졌다는 걸.`,
    ogTitle: "나는 『돈키호테』의 돈키호테였다",
    ogDescription: "사라진 것을 위해서도 끝까지 그 자리를 지키는 쪽이었다.",
  },

  hamlet: {
    type: 'hamlet',
    characterName: '햄릿',
    character: '『햄릿』의 햄릿',
    title: '당신은 『햄릿』의 햄릿입니다.',
    description: ['결정해야 하는 순간에도',
                ' 당신은 쉽게 움직이지 못합니다.',
                ' 그 사이에서 시간이 흘러갑니다.'],
    storyTitle: '74. 도강',
    storyText: `“내래 연결선을 안다우.”
“갓나새끼, 니가 어찌 연결선을 안단 말이가?”
“옌지에 파견 나간 벌목공을 안다우.”
“옌지? 거 옌변 조선족은 말도 말라. 소개꾼이 아니라 인신매매꾼인기야.”

말이 끊겼다. 찬성과 복만은 실랑이 할 힘도 없어 서로 등을 지고 기대었다.

"하, 연결선이 다 무신 말이간? 이거 장마당이라도 나가봐야지."
"입 닫아라. 그러다 끌려간다. 땅이나 파라."
"땅을 파면 강냉이 한쪽이라도 나온? 여즉 모르메? 다 우리들 잡아두려는 수작질인기야!"

비어있는 복만의 눈동자에 얼어붙은 두만강과 딸아이의 얼굴이 차올랐다. 몇 년 전, 돌림병이 창궐하기 전에 그 어린 녀석을 안고 도강했어야 했다. 때늦은 후회가 새까만 강물처럼 고여 들었다.

"까이 꺼, 서쪽으로 건너자."
"거긴 깊다. 얼지도 않고, 철책하고 총도 있다."
"아니, 태풍 올 때."
"그때까지… 우리가 살겠나?"

찬성은 입을 닫았다.
여름까지 6개월이 아니라, 당장 6분, 아니 6초가 버거웠다.`,
    ogTitle: "나는 『햄릿』의 햄릿이었다",
    ogDescription: "결정해야 하는 순간에도, 쉽게 움직이지 못하는 쪽이었다.",
  },
};
